# 第三章

In [22]:
import numpy as np
import pandas as pd

## 一、索引器
### 1.表的列索引
['列名']装列索引，返回Series

In [23]:
df=pd.read_csv('D:\\datawhale\\joyful-pandas\\data\\learn_pandas.csv',usecols=['School','Grade','Name','Gender','Weight','Transfer'])

In [24]:
df['Name'].head()

0      Gaopeng Yang
1    Changqiang You
2           Mei Sun
3      Xiaojuan Sun
4       Gaojuan You
Name: Name, dtype: object

除了[],也可以.列名，是一样的哦

In [25]:
df.Name.head()

0      Gaopeng Yang
1    Changqiang You
2           Mei Sun
3      Xiaojuan Sun
4       Gaojuan You
Name: Name, dtype: object

多列就[[列名字的组合]]，框框嵌套，返回一个DataFrame

In [26]:
df[['Gender', 'Name']].head()

   Gender            Name
0  Female    Gaopeng Yang
1    Male  Changqiang You
2    Male         Mei Sun
3  Female    Xiaojuan Sun
4    Male     Gaojuan You

### 2.序列的行索引

- 以字符串为索引的Series

如果取出单个索引的对应元素，则可以使用 [item] ，若 Series 只有单个值对应，则返回这个标量值，如果有多个值对应，则返回一个 Series

In [27]:
s=pd.Series([1,2,3,4,5,6],index=['a','b','a','a','a','c'])
s['a']

a    1
a    3
a    4
a    5
dtype: int64

In [28]:
s['b']

2

[[]]，框框嵌套，取多个索引对应的元素

In [29]:
s[['c','b']]

c    6
b    2
dtype: int64

取出两个索引之间的元素，要注意，这两个索引在整个索引中唯一出现，才可以使用切片，也要注意切片含有两个端点

In [30]:
s['c': 'b': -2]

c    6
a    4
b    2
dtype: int64

- 以整数为索引的Series

In [31]:
s=pd.Series(['a','b','c','c','e','f'],index=[1,3,1,2,5,4])
s[1]

1    a
1    c
dtype: object

In [32]:
s[[2,3]]

2    c
3    b
dtype: object

使用整数切片，则会取出对应索引 位置 的值，注意这里的整数切片同 Python 中的切片一样不包含右端点

In [33]:
s[1:-2:2]#取出索引一般不是start：end：step吗？这里是？

3    b
2    c
dtype: object

#### 【warning】
如果不想陷入麻烦，那么请不要把纯浮点以及任何混合类型（字符串、整数、浮点类型等的混合）作为索引，否则可能会在具体的操作时报错或者返回非预期的结果，并且在实际的数据分析中也不存在这样做的动机。

### 3.loc索引器

一种是基于 元素 的 loc 索引器，另一种是基于 位置 的 iloc 索引器。

loc 索引器的一般形式是 loc[ * ,  * ] ，其中第一个 * 代表行的选择，第二个 * 代表列的选择，如果省略第二个位置写作 loc[ * ] ，这个 * 是指行的筛选。其中， * 的位置一共有五类合法对象，分别是：单个元素、元素列表、元素切片、布尔列表以及函数，下面将依次说明。

先利用 `set_index` 方法把 `Name` 列设为索引

In [34]:
df_demo=df.set_index('Name')
df_demo.head()

,School,Grade,Gender,Weight,Transfer
Name,,,,,
Gaopeng Yang,Shanghai Jiao Tong University,Freshman,Female,46.0,N
Changqiang You,Peking University,Freshman,Male,70.0,N
Mei Sun,Shanghai Jiao Tong University,Senior,Male,89.0,N
Xiaojuan Sun,Fudan University,Sophomore,Female,41.0,N
Gaojuan You,Fudan University,Sophomore,Male,74.0,N

- \* 为单个元素

In [35]:
df_demo.loc['Qiang Sun']#多个人叫这个名字，返回DataFrame

                                  School      Grade  Gender  Weight Transfer
Name
Qiang Sun            Tsinghua University     Junior  Female    53.0        N
Qiang Sun            Tsinghua University  Sophomore  Female    40.0        N
Qiang Sun  Shanghai Jiao Tong University     Junior  Female     NaN        N

In [36]:
df_demo.index

Index(['Gaopeng Yang', 'Changqiang You', 'Mei Sun', 'Xiaojuan Sun',
       'Gaojuan You', 'Xiaoli Qian', 'Qiang Chu', 'Gaoqiang Qian',
       'Changli Zhang', 'Juan Xu',
       ...
       'Changli Qin', 'Li Sun', 'Gaojuan Wang', 'Xiaoqiang Qin', 'Yanmei Qian',
       'Xiaojuan Sun', 'Li Zhao', 'Chengqiang Chu', 'Chengmei Shen',
       'Chunpeng Lv'],
      dtype='object', name='Name', length=200)

df_demo['Qiang Sun']这样以index为索引会报错，因为对表用索引提取得用.loc，序列的索引才可以直接用

In [37]:
df_demo.loc['Quan Zhao']#名字是唯一的，返回Series

School      Shanghai Jiao Tong University
Grade                              Junior
Gender                             Female
Weight                                 53
Transfer                                N
Name: Quan Zhao, dtype: object

也可以同时选择行和列

In [38]:
df_demo.loc['Qiang Sun','School']

Name
Qiang Sun              Tsinghua University
Qiang Sun              Tsinghua University
Qiang Sun    Shanghai Jiao Tong University
Name: School, dtype: object

In [39]:
df_demo.loc['Quan Zhao','School']

'Shanghai Jiao Tong University'

- \* 为元素列表

In [40]:
df_demo.loc[['Qiang Sun','Quan Zhao'], ['School','Gender']]

                                  School  Gender
Name
Qiang Sun            Tsinghua University  Female
Qiang Sun            Tsinghua University  Female
Qiang Sun  Shanghai Jiao Tong University  Female
Quan Zhao  Shanghai Jiao Tong University  Female

- \* 为切片

In [41]:
df_demo.loc['Gaojuan You':'Gaoqiang Qian', 'School':'Gender']

                                      School      Grade  Gender
Name
Gaojuan You                 Fudan University  Sophomore    Male
Xiaoli Qian              Tsinghua University   Freshman  Female
Qiang Chu      Shanghai Jiao Tong University   Freshman  Female
Gaoqiang Qian            Tsinghua University     Junior  Female

如果 DataFrame 使用整数索引，其使用整数切片的时候和上面字符串索引的要求一致，都是 元素 切片，包含端点且起点、终点不允许有重复值

In [42]:
df_loc_slice_demo = df_demo.copy()
df_loc_slice_demo.index = range(df_demo.shape[0],0,-1)
df_loc_slice_demo.index

RangeIndex(start=200, stop=0, step=-1)

In [43]:
df_loc_slice_demo.loc[5:3]

                          School   Grade  Gender  Weight Transfer
5               Fudan University  Junior  Female    46.0        N
4            Tsinghua University  Senior  Female    50.0        N
3  Shanghai Jiao Tong University  Senior  Female    45.0        N

In [44]:
df_loc_slice_demo.loc[3:-1:5] # 没有返回，说明不是整数位置切片

                          School   Grade  Gender  Weight Transfer
3  Shanghai Jiao Tong University  Senior  Female    45.0        N

In [45]:
df_loc_slice_demo.loc[5:-1:3]

                          School   Grade  Gender  Weight Transfer
5               Fudan University  Junior  Female    46.0        N
2  Shanghai Jiao Tong University  Senior    Male    71.0        N

- \*为布尔列表

根据条件来筛选行是极其常见的，此处传入 loc 的布尔列表与 DataFrame 长度相同，且列表为 True 的位置所对应的行会被选中， False 则会被剔除。

In [46]:
df_demo.loc[df_demo.Weight>70].head()

,School,Grade,Gender,Weight,Transfer
Name,,,,,
Mei Sun,Shanghai Jiao Tong University,Senior,Male,89.0,N
Gaojuan You,Fudan University,Sophomore,Male,74.0,N
Xiaopeng Zhou,Shanghai Jiao Tong University,Freshman,Male,74.0,N
Xiaofeng Sun,Tsinghua University,Senior,Male,71.0,N
Qiang Zheng,Shanghai Jiao Tong University,Senior,Male,87.0,N

也可以通过 `isin` 方法返回的布尔列表

In [47]:
df_demo.loc[df_demo.Grade.isin(['Freshman', 'Senior'])].head()

,School,Grade,Gender,Weight,Transfer
Name,,,,,
Gaopeng Yang,Shanghai Jiao Tong University,Freshman,Female,46.0,N
Changqiang You,Peking University,Freshman,Male,70.0,N
Mei Sun,Shanghai Jiao Tong University,Senior,Male,89.0,N
Xiaoli Qian,Tsinghua University,Freshman,Female,51.0,N
Qiang Chu,Shanghai Jiao Tong University,Freshman,Female,52.0,N

复合条件而言，可以用 \|（或）, \&（且）, \~（取反） 的组合来实现

In [48]:
condition_1_1 = df_demo.School == 'Fudan University'
condition_1_2 = df_demo.Grade == 'Senior'
condition_1_3 = df_demo.Weight > 70
condition_1 = condition_1_1 & condition_1_2 & condition_1_3
condition_2_1 = df_demo.School == 'Peking University'
condition_2_2 = df_demo.Grade == 'Senior'
condition_2_3 = df_demo.Weight > 80
condition_2 = condition_2_1 & (~condition_2_2) & condition_2_3
#这样定义出来的条件都是以原数组的索引为索引的一个true，false的序列，直接放进【】是对的
df_demo.loc[condition_1 | condition_2]

                           School     Grade Gender  Weight Transfer
Name
Qiang Han       Peking University  Freshman   Male    87.0        N
Chengpeng Zhou   Fudan University    Senior   Male    81.0        N
Changpeng Zhao  Peking University  Freshman   Male    83.0        N
Chengpeng Qian   Fudan University    Senior   Male    73.0        Y

#### 【练一练】
select_dtypes 是一个实用函数，它能够从表中选出相应类型的列，若要选出所有数值型的列，只需使用 .select_dtypes('number') ，请利用布尔列表选择的方法结合 DataFrame 的 dtypes 属性在 learn_pandas 数据集上实现这个功能。

In [49]:
df.select_dtypes('number').head()

   Weight
0    46.0
1    70.0
2    89.0
3    41.0
4    74.0

In [50]:
df.index

RangeIndex(start=0, stop=200, step=1)

In [51]:
condition=df.dtypes== 'float64'
condition#这样定义出来的条件是以列名为索引的true，flase的序列，所以不能直接放进【】
#还需得定义一下行索引
#和群里的小伙伴交流之后，得到了以下解法

School      False
Grade       False
Name        False
Gender      False
Weight       True
Transfer    False
dtype: bool

In [52]:
condition=df.dtypes.isin([float])
condition

School      False
Grade       False
Name        False
Gender      False
Weight       True
Transfer    False
dtype: bool

In [53]:
condition=df.dtypes.apply(lambda x:x in ['float64','float32'])
condition

School      False
Grade       False
Name        False
Gender      False
Weight       True
Transfer    False
dtype: bool

In [54]:
df.loc[:,condition].head()

   Weight
0    46.0
1    70.0
2    89.0
3    41.0
4    74.0

- \*为函数

这里的函数，必须以前面的四种合法形式之一为返回值，并且函数的输入值为 DataFrame 本身。假设仍然是上述复合条件筛选的例子，可以把逻辑写入一个函数中再返回，需要注意的是函数的形式参数 x 本质上即为 df_demo

In [55]:
def condition(x):
    condition_1_1 = x.School == 'Fudan University'
    condition_1_2 = x.Grade == 'Senior'
    condition_1_3 = x.Weight > 70
    condition_1 = condition_1_1 & condition_1_2 & condition_1_3
    condition_2_1 = x.School == 'Peking University'
    condition_2_2 = x.Grade == 'Senior'
    condition_2_3 = x.Weight > 80
    condition_2 = condition_2_1 & (~condition_2_2) & condition_2_3
    result = condition_1 | condition_2
    return result

df_demo.loc[condition]

                           School     Grade Gender  Weight Transfer
Name
Qiang Han       Peking University  Freshman   Male    87.0        N
Chengpeng Zhou   Fudan University    Senior   Male    81.0        N
Changpeng Zhao  Peking University  Freshman   Male    83.0        N
Chengpeng Qian   Fudan University    Senior   Male    73.0        Y

lambda当然也可以哦

In [56]:
df_demo.loc[lambda x:'Quan Zhao', lambda x:'Gender']

'Female'

In [57]:
df_demo.loc[lambda x: slice('Gaojuan You', 'Gaoqiang Qian')]#函数里面的切片是这样的

,School,Grade,Gender,Weight,Transfer
Name,,,,,
Gaojuan You,Fudan University,Sophomore,Male,74.0,N
Xiaoli Qian,Tsinghua University,Freshman,Female,51.0,N
Qiang Chu,Shanghai Jiao Tong University,Freshman,Female,52.0,N
Gaoqiang Qian,Tsinghua University,Junior,Female,50.0,N

#### 【warning】不要使用链式赋值
在对表或者序列赋值时，应当在使用一层索引器后直接进行赋值操作，这样做是由于进行多次索引后赋值是赋在临时返回的 copy 副本上的，而没有真正修改元素从而报出 SettingWithCopyWarning 警告。例如，下面给出的例子：

In [58]:
df_chain = pd.DataFrame([[0,0],[1,0],[-1,0]], columns=list('AB'))
df_chain

   A  B
0  0  0
1  1  0
2 -1  0

In [59]:
import warnings
with warnings.catch_warnings():
    warnings.filterwarnings('error')
    try:
        df_chain[df_chain.A!=0].B = 1 # 使用方括号列索引后，再使用点的列索引
    except Warning as w:
        Warning_Msg = w
        
print(Warning_Msg)

A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [60]:
df_chain.loc[df_chain.A!=0,'B'] = 1
df_chain

   A  B
0  0  0
1  1  1
2 -1  1

### 4.iloc索引器
iloc 的使用与 loc 完全类似，只不过是针对位置进行筛选，在相应的 * 位置处一共也有五类合法对象，分别是：整数、整数列表、整数切片、布尔列表以及函数，函数的返回值必须是前面的四类合法对象中的一个

In [61]:
df_demo.iloc[1, 1] # 第二行第二列

'Freshman'

In [62]:
df_demo.iloc[[0, 1], [0, 1]] # 前两行前两列

                                       School     Grade
Name
Gaopeng Yang    Shanghai Jiao Tong University  Freshman
Changqiang You              Peking University  Freshman

In [63]:
df_demo.iloc[1: 4, 2:4] # 切片不包含结束端点

                Gender  Weight
Name
Changqiang You    Male    70.0
Mei Sun           Male    89.0
Xiaojuan Sun    Female    41.0

In [64]:
df_demo.iloc[lambda x: slice(1, 4)] # 传入切片为返回值的函数

,School,Grade,Gender,Weight,Transfer
Name,,,,,
Changqiang You,Peking University,Freshman,Male,70.0,N
Mei Sun,Shanghai Jiao Tong University,Senior,Male,89.0,N
Xiaojuan Sun,Fudan University,Sophomore,Female,41.0,N

In [65]:
df_demo.iloc[(df_demo.Weight>80).values].head()#要传入values而不能像loc一样传入series
#用loc比较好

,School,Grade,Gender,Weight,Transfer
Name,,,,,
Mei Sun,Shanghai Jiao Tong University,Senior,Male,89.0,N
Qiang Zheng,Shanghai Jiao Tong University,Senior,Male,87.0,N
Qiang Han,Peking University,Freshman,Male,87.0,N
Chengpeng Zhou,Fudan University,Senior,Male,81.0,N
Feng Han,Shanghai Jiao Tong University,Sophomore,Male,82.0,N

In [66]:
df_demo.School.iloc[1]

'Peking University'

In [67]:
df_demo.School.iloc[1:5:2]#1,3,返回相应位置的值或者子序列

Name
Changqiang You    Peking University
Xiaojuan Sun       Fudan University
Name: School, dtype: object

### 5.query方法
把字符串形式的查询表达式传入 query 方法来查询数据，其表达式的执行结果必须返回布尔列表。在进行复杂索引时，由于这种检索方式无需像普通方法一样重复使用 DataFrame 的名字来引用列名，一般而言会使代码长度在不降低可读性的前提下有所减少

In [68]:
df.query('((School == "Fudan University")&'' (Grade == "Senior")&'' (Weight > 70))|''((School == "Peking University")&'' (Grade != "Senior")&'' (Weight > 80))')

                School     Grade            Name Gender  Weight Transfer
38   Peking University  Freshman       Qiang Han   Male    87.0        N
66    Fudan University    Senior  Chengpeng Zhou   Male    81.0        N
99   Peking University  Freshman  Changpeng Zhao   Male    83.0        N
131   Fudan University    Senior  Chengpeng Qian   Male    73.0        Y

 query 表达式中，帮用户注册了所有来自 DataFrame 的列名，所有属于该 Series 的方法都可以被调用，和正常的函数调用并没有区别

In [69]:
 df.query('Weight > Weight.mean()').head()

,School,Grade,Name,Gender,Weight,Transfer
1,Peking University,Freshman,Changqiang You,Male,70.0,N
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,89.0,N
4,Fudan University,Sophomore,Gaojuan You,Male,74.0,N
10,Shanghai Jiao Tong University,Freshman,Xiaopeng Zhou,Male,74.0,N
14,Tsinghua University,Senior,Xiaomei Zhou,Female,57.0,N

 query 中还注册了若干英语的字面用法，帮助提高可读性，例如： or, and, or, is in, not in

In [70]:
df.query('(Grade not in ["Freshman", "Sophomore"]) and''(Gender == "Male")').head()

,School,Grade,Name,Gender,Weight,Transfer
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,89.0,N
16,Tsinghua University,Junior,Xiaoqiang Qin,Male,68.0,N
17,Tsinghua University,Junior,Peng Wang,Male,65.0,N
18,Tsinghua University,Senior,Xiaofeng Sun,Male,71.0,N
21,Shanghai Jiao Tong University,Senior,Xiaopeng Shen,Male,62.0,NaN

 == 和 != 分别表示元素出现在列表和没有出现在列表，等价于 is in 和 not in

In [71]:
df.query('Grade == ["Junior", "Senior"]').head()

,School,Grade,Name,Gender,Weight,Transfer
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,89.0,N
7,Tsinghua University,Junior,Gaoqiang Qian,Female,50.0,N
9,Peking University,Junior,Juan Xu,Female,NaN,N
11,Tsinghua University,Junior,Xiaoquan Lv,Female,43.0,N
12,Shanghai Jiao Tong University,Senior,Peng You,Female,48.0,NaN

要引用外部变量，只需在变量名前加 @ 符号

In [72]:
low, high =70, 80
#df.query('Weight.between(df.query('@low，@high)').head()这里面between的使用有问题
df.query('Weight==@low')

,School,Grade,Name,Gender,Weight,Transfer
1,Peking University,Freshman,Changqiang You,Male,70.0,N
50,Shanghai Jiao Tong University,Junior,Xiaoli Wang,Male,70.0,N
72,Peking University,Junior,Gaoquan Zhou,Male,70.0,N
150,Tsinghua University,Junior,Chengpeng You,Male,70.0,Y
192,Shanghai Jiao Tong University,Senior,Gaojuan Wang,Male,70.0,N

### 6.随机抽样

把 DataFrame 的每一行看作一个样本，或把每一列看作一个特征，再把整个 DataFrame 看作总体，想要对样本或特征进行随机抽样就可以用 sample 函数

sample 函数中的主要参数为 `n`, `axis`, `frac`, `replace`, `weights` ，前三个分别是指抽样数量、抽样的方向（0为行、1为列）和抽样比例（0.3则为从总体中抽出30%的样本）。replace 和 weights 分别是指是否放回和每个样本的抽样相对概率，当 replace = True 则表示有放回抽样。

In [73]:
df_sample = pd.DataFrame({'id': list('abcde'),'value': [1, 2, 3, 4, 90]})
df_sample

  id  value
0  a      1
1  b      2
2  c      3
3  d      4
4  e     90

In [74]:
df_sample.sample(3, replace =True, weights = df_sample.value)

  id  value
4  e     90
4  e     90
4  e     90

## 二、多级索引
### 1.多级索引及其表的结构

In [75]:
np.random.seed(0)
multi_index=pd.MultiIndex.from_product([list('ABCD'), df.Gender.unique()], names=('School', 'Gender'))
multi_column = pd.MultiIndex.from_product([['Height', 'Weight'],df.Grade.unique()], names=('Indicator', 'Grade'))
df_multi = pd.DataFrame(np.c_[(np.random.randn(8,4)*5 + 163).tolist(),(np.random.randn(8,4)*5 + 65).tolist()],index = multi_index,columns = multi_column).round(1)
df_multi

Indicator       Height                           Weight                   \
Grade         Freshman Senior Sophomore Junior Freshman Senior Sophomore
School Gender
A      Female    171.8  165.0     167.9  174.2     60.6   55.1      63.3
       Male      172.3  158.1     167.8  162.2     71.2   71.0      63.1
B      Female    162.5  165.1     163.7  170.3     59.8   57.9      56.5
       Male      166.8  163.6     165.2  164.7     62.5   62.8      58.7
C      Female    170.5  162.0     164.6  158.7     56.9   63.9      60.5
       Male      150.2  166.3     167.3  159.3     62.4   59.1      64.9
D      Female    174.3  155.7     163.2  162.1     65.3   66.5      61.8
       Male      170.7  170.3     163.8  164.9     61.6   63.2      60.9

Indicator
Grade         Junior
School Gender
A      Female   65.8
       Male     63.5
B      Female   74.8
       Male     68.9
C      Female   66.9
       Male     67.1
D      Female   63.2
       Male     56.4

图中的 School 和 Gender 分别对应了表的第一层和第二层行索引的名字， Indicator 和 Grade 分别对应了第一层和第二层列索引的名字。

- 索引的名字和值属性分别通过`names`和`values`获得

In [76]:
df_multi.index.names

FrozenList(['School', 'Gender'])

In [77]:
df_multi.columns.names

FrozenList(['Indicator', 'Grade'])

In [78]:
df_multi.index.values

array([('A', 'Female'), ('A', 'Male'), ('B', 'Female'), ('B', 'Male'),
       ('C', 'Female'), ('C', 'Male'), ('D', 'Female'), ('D', 'Male')],
      dtype=object)

In [79]:
df_multi.columns.values

array([('Height', 'Freshman'), ('Height', 'Senior'),
       ('Height', 'Sophomore'), ('Height', 'Junior'),
       ('Weight', 'Freshman'), ('Weight', 'Senior'),
       ('Weight', 'Sophomore'), ('Weight', 'Junior')], dtype=object)

- 得到某一层的索引用`get_level_values`

In [80]:
df_multi.index.get_level_values(0)

Index(['A', 'A', 'B', 'B', 'C', 'C', 'D', 'D'], dtype='object', name='School')

### 2.多级索引中的loc索引器
回到原表，将学校和年级设为索引，此时的行为多级索引，列为单级索引，由于默认状态的列索引不含名字，因此对应于刚刚图中 Indicator 和 Grade 的索引名位置是空缺的。

In [81]:
df_multi=df.set_index(['School','Grade'])
df_multi.head()

                                                   Name  Gender  Weight  \
School                        Grade
Shanghai Jiao Tong University Freshman     Gaopeng Yang  Female    46.0
Peking University             Freshman   Changqiang You    Male    70.0
Shanghai Jiao Tong University Senior            Mei Sun    Male    89.0
Fudan University              Sophomore    Xiaojuan Sun  Female    41.0
                              Sophomore     Gaojuan You    Male    74.0

                                        Transfer
School                        Grade
Shanghai Jiao Tong University Freshman         N
Peking University             Freshman         N
Shanghai Jiao Tong University Senior           N
Fudan University              Sophomore        N
                              Sophomore        N

- 多级索引中的loc索引器

In [82]:
df_multi=df_multi.sort_index()
df_multi.head()

                                      Name  Gender  Weight Transfer
School           Grade
Fudan University Freshman  Changqiang Yang  Female    49.0        N
                 Freshman     Gaoqiang Qin  Female    63.0        N
                 Freshman     Gaofeng Zhao  Female    43.0        N
                 Freshman     Yanquan Wang  Female    55.0        N
                 Freshman        Feng Wang    Male    74.0        N

In [83]:
df_multi.loc[('Fudan University','Junior')].head()

                                  Name  Gender  Weight Transfer
School           Grade
Fudan University Junior      Yanli You  Female    48.0        N
                 Junior  Chunqiang Chu    Male    72.0        N
                 Junior   Changfeng Lv    Male    76.0        N
                 Junior     Yanjuan Lv  Female    49.0      NaN
                 Junior  Gaoqiang Zhou  Female    43.0        N

In [84]:
df_multi.loc[[('Fudan University','Junior'),('Shanghai Jiao Tong University', 'Freshman')]].head()
#[[(),(),()]]
#复旦的大三与上交的大一学生

                                  Name  Gender  Weight Transfer
School           Grade
Fudan University Junior      Yanli You  Female    48.0        N
                 Junior  Chunqiang Chu    Male    72.0        N
                 Junior   Changfeng Lv    Male    76.0        N
                 Junior     Yanjuan Lv  Female    49.0      NaN
                 Junior  Gaoqiang Zhou  Female    43.0        N

In [85]:
df_multi.loc[df_multi.Weight > 70].head()#布尔列表

                                     Name Gender  Weight Transfer
School           Grade
Fudan University Freshman       Feng Wang   Male    74.0        N
                 Junior     Chunqiang Chu   Male    72.0        N
                 Junior      Changfeng Lv   Male    76.0        N
                 Senior    Chengpeng Zhou   Male    81.0        N
                 Senior    Chengpeng Qian   Male    73.0        Y

In [86]:
df_multi.loc[lambda x:('Fudan University','Junior')].head()
#隐藏函数

                                  Name  Gender  Weight Transfer
School           Grade
Fudan University Junior      Yanli You  Female    48.0        N
                 Junior  Chunqiang Chu    Male    72.0        N
                 Junior   Changfeng Lv    Male    76.0        N
                 Junior     Yanjuan Lv  Female    49.0      NaN
                 Junior  Gaoqiang Zhou  Female    43.0        N

In [87]:
res = df_multi.loc[(['Peking University', 'Fudan University'],['Sophomore', 'Junior']), :]
#传入 loc 的形式为 [(level_0_list, level_1_list), cols] 
#多级索引中的元组有一种特殊的用法，可以对多层的元素进行交叉组合后索引，但同时需要指定 loc 的列，全选则用 : 表示
res.head()
#北大和复旦的大二大三学生

                                     Name  Gender  Weight Transfer
School            Grade
Peking University Sophomore   Changmei Xu  Female    43.0        N
                  Sophomore  Xiaopeng Qin    Male     NaN        N
                  Sophomore        Mei Xu  Female    39.0        N
                  Sophomore   Xiaoli Zhou  Female    55.0        N
                  Sophomore      Peng Han  Female    34.0      NaN

### 3.IndexSlice对象
Slice 对象一共有两种形式，第一种为 loc[idx[\*,\*]] 型，第二种为 loc[idx[\*,\*],idx[\*,\*]] 型

In [88]:
np.random.seed(0)
L1,L2 = ['A','B','C'],['a','b','c']
mul_index1 = pd.MultiIndex.from_product([L1,L2],names=('Upper', 'Lower'))
L3,L4 = ['D','E','F'],['d','e','f']
mul_index2 = pd.MultiIndex.from_product([L3,L4],names=('Big', 'Small'))
df_ex = pd.DataFrame(np.random.randint(-9,10,(9,9)),index=mul_index1,columns=mul_index2)
df_ex

Big          D        E        F
Small        d  e  f  d  e  f  d  e  f
Upper Lower
A     a      3  6 -9 -6 -6 -2  0  9 -5
      b     -3  3 -8 -3 -2  5  8 -4  4
      c     -1  0  7 -4  6  6 -9  9 -6
B     a      8  5 -2 -9 -8  0 -9  1 -6
      b      2  9 -7 -9 -9 -5 -4 -3 -1
      c      8  6 -5  0  1 -8 -8 -2  0
C     a     -6 -3  2  5  9 -9  5 -6  3
      b      1  2 -5 -3 -5  6 -6  3 -5
      c     -1  5  6 -6  6  4  7  8 -4

In [89]:
idx = pd.IndexSlice

- loc[idx[\*,\*]]

In [90]:
df_ex.loc[idx[:'A',lambda x:x.sum()>0]]#行为A，列的和大于0
#切片和布尔列表混合使用

Big          D     F
Small        d  e  e
Upper Lower
A     a      3  6  9
      b     -3  3 -4
      c     -1  0  9

In [91]:
df_ex.loc[idx['C':, ('D', 'f'):]]#切片法

Big          D  E        F
Small        f  d  e  f  d  e  f
Upper Lower
C     a      2  5  9 -9  5 -6  3
      b     -5 -3 -5  6 -6  3 -5
      c      6 -6  6  4  7  8 -4

- loc[idx[\*,\*],idx[\*,\*]]

In [92]:
df_ex.loc[idx[:'A', 'b':], idx['E':, 'e':]]#前一个idx为行索引，后一个idx为列索引

Big          E     F
Small        e  f  e  f
Upper Lower
A     b     -2  5 -4  4
      c      6  6  9 -6

### 4.多级索引的构造
构造多级索引的方法：set_index， from_tuples, from_arrays, from_product

- from_tuples 指根据传入由元组组成的列表进行构造

In [93]:
my_tuple = [('a','cat'),('a','dog'),('b','cat'),('b','dog')]
pd.MultiIndex.from_tuples(my_tuple, names=['First','Second'])

MultiIndex([('a', 'cat'),
            ('a', 'dog'),
            ('b', 'cat'),
            ('b', 'dog')],
           names=['First', 'Second'])

- from_arrays 指根据传入列表中，对应层的列表进行构造

In [94]:
my_array = [list('aabb'), ['cat', 'dog']*2]
pd.MultiIndex.from_arrays(my_array, names=['First','Second'])

MultiIndex([('a', 'cat'),
            ('a', 'dog'),
            ('b', 'cat'),
            ('b', 'dog')],
           names=['First', 'Second'])

- from_product 指根据给定多个列表的笛卡尔积进行构造

In [95]:
my_list1 = ['a','b']
my_list2 = ['cat','dog']
pd.MultiIndex.from_product([my_list1,my_list2],names=['First','Second'])

MultiIndex([('a', 'cat'),
            ('a', 'dog'),
            ('b', 'cat'),
            ('b', 'dog')],
           names=['First', 'Second'])

## 三、索引的常用方法
### 1.索引层的交换和删除

In [96]:
np.random.seed(0)
L1,L2,L3 = ['A','B'],['a','b'],['alpha','beta']
mul_index1 = pd.MultiIndex.from_product([L1,L2,L3],names=('Upper', 'Lower','Extra'))
L4,L5,L6 = ['C','D'],['c','d'],['cat','dog']
mul_index2 = pd.MultiIndex.from_product([L4,L5,L6],names=('Big', 'Small', 'Other'))
df_ex = pd.DataFrame(np.random.randint(-9,10,(8,8)),index=mul_index1,columns=mul_index2)
df_ex

Big                 C               D
Small               c       d       c       d
Other             cat dog cat dog cat dog cat dog
Upper Lower Extra
A     a     alpha   3   6  -9  -6  -6  -2   0   9
            beta   -5  -3   3  -8  -3  -2   5   8
      b     alpha  -4   4  -1   0   7  -4   6   6
            beta   -9   9  -6   8   5  -2  -9  -8
B     a     alpha   0  -9   1  -6   2   9  -7  -9
            beta   -9  -5  -4  -3  -1   8   6  -5
      b     alpha   0   1  -8  -8  -2   0  -6  -3
            beta    2   5   9  -9   5  -6   3   1

- swaplevel交换两个层，reorder_levels交换任意层

In [97]:
df_ex.swaplevel(0,2,axis=1).head() # 列索引的第一层和第三层交换

Other             cat dog cat dog cat dog cat dog
Small               c   c   d   d   c   c   d   d
Big                 C   C   C   C   D   D   D   D
Upper Lower Extra
A     a     alpha   3   6  -9  -6  -6  -2   0   9
            beta   -5  -3   3  -8  -3  -2   5   8
      b     alpha  -4   4  -1   0   7  -4   6   6
            beta   -9   9  -6   8   5  -2  -9  -8
B     a     alpha   0  -9   1  -6   2   9  -7  -9

In [98]:
df_ex.reorder_levels([2,0,1],axis=0).head() # 列表数字指代原来索引中的层

Big                 C               D
Small               c       d       c       d
Other             cat dog cat dog cat dog cat dog
Extra Upper Lower
alpha A     a       3   6  -9  -6  -6  -2   0   9
beta  A     a      -5  -3   3  -8  -3  -2   5   8
alpha A     b      -4   4  -1   0   7  -4   6   6
beta  A     b      -9   9  -6   8   5  -2  -9  -8
alpha B     a       0  -9   1  -6   2   9  -7  -9

- droplevel删除某一层的索引

In [99]:
df_ex.droplevel(1,axis=1)

Big                 C               D
Other             cat dog cat dog cat dog cat dog
Upper Lower Extra
A     a     alpha   3   6  -9  -6  -6  -2   0   9
            beta   -5  -3   3  -8  -3  -2   5   8
      b     alpha  -4   4  -1   0   7  -4   6   6
            beta   -9   9  -6   8   5  -2  -9  -8
B     a     alpha   0  -9   1  -6   2   9  -7  -9
            beta   -9  -5  -4  -3  -1   8   6  -5
      b     alpha   0   1  -8  -8  -2   0  -6  -3
            beta    2   5   9  -9   5  -6   3   1

In [100]:
df_ex.droplevel([0,1],axis=0)

Big     C               D
Small   c       d       c       d
Other cat dog cat dog cat dog cat dog
Extra
alpha   3   6  -9  -6  -6  -2   0   9
beta   -5  -3   3  -8  -3  -2   5   8
alpha  -4   4  -1   0   7  -4   6   6
beta   -9   9  -6   8   5  -2  -9  -8
alpha   0  -9   1  -6   2   9  -7  -9
beta   -9  -5  -4  -3  -1   8   6  -5
alpha   0   1  -8  -8  -2   0  -6  -3
beta    2   5   9  -9   5  -6   3   1

### 2.索引属性的修改

- rename_axis对索引层的名字进行修改

In [101]:
df_ex.rename_axis(index={'Upper':'Changed_row'},columns={'Other':'Changed_Col'}).head()
#建立字典映射

Big                       C               D
Small                     c       d       c       d
Changed_Col             cat dog cat dog cat dog cat dog
Changed_row Lower Extra
A           a     alpha   3   6  -9  -6  -6  -2   0   9
                  beta   -5  -3   3  -8  -3  -2   5   8
            b     alpha  -4   4  -1   0   7  -4   6   6
                  beta   -9   9  -6   8   5  -2  -9  -8
B           a     alpha   0  -9   1  -6   2   9  -7  -9

- rename对索引的值进行修改，多级索引需用level指定修改的层号

In [102]:
df_ex.rename(columns={'cat':'not_cat'},level=2).head()

Big                     C                       D
Small                   c           d           c           d
Other             not_cat dog not_cat dog not_cat dog not_cat dog
Upper Lower Extra
A     a     alpha       3   6      -9  -6      -6  -2       0   9
            beta       -5  -3       3  -8      -3  -2       5   8
      b     alpha      -4   4      -1   0       7  -4       6   6
            beta       -9   9      -6   8       5  -2      -9  -8
B     a     alpha       0  -9       1  -6       2   9      -7  -9

In [103]:
df_ex.rename(index=lambda x:str.upper(x),level=2).head()

Big                 C               D
Small               c       d       c       d
Other             cat dog cat dog cat dog cat dog
Upper Lower Extra
A     a     ALPHA   3   6  -9  -6  -6  -2   0   9
            BETA   -5  -3   3  -8  -3  -2   5   8
      b     ALPHA  -4   4  -1   0   7  -4   6   6
            BETA   -9   9  -6   8   5  -2  -9  -8
B     a     ALPHA   0  -9   1  -6   2   9  -7  -9

In [104]:
new_values =iter(list('abcdefgh'))
df_ex.rename(index=lambda x:next(new_values),level=2)
#对整个索引进行替换，利用迭代器

Big                 C               D
Small               c       d       c       d
Other             cat dog cat dog cat dog cat dog
Upper Lower Extra
A     a     a       3   6  -9  -6  -6  -2   0   9
            b      -5  -3   3  -8  -3  -2   5   8
      b     c      -4   4  -1   0   7  -4   6   6
            d      -9   9  -6   8   5  -2  -9  -8
B     a     e       0  -9   1  -6   2   9  -7  -9
            f      -9  -5  -4  -3  -1   8   6  -5
      b     g       0   1  -8  -8  -2   0  -6  -3
            h       2   5   9  -9   5  -6   3   1

对某个位置的元素进行修改，在单层索引时容易实现，即先取出索引的 values 属性，再给对得到的列表进行修改，最后再对 index 对象重新赋值。但是如果是多级索引的话就有些麻烦，一个解决的方案是先把某一层索引临时转为表的元素，然后再进行修改，最后重新设定为索引

- map函数

In [105]:
df_temp = df_ex.copy()
new_idx = df_temp.index.map(lambda x: (x[0],x[1],str.upper(x[2])))
df_temp.index = new_idx
df_temp.head()

Big                 C               D
Small               c       d       c       d
Other             cat dog cat dog cat dog cat dog
Upper Lower Extra
A     a     ALPHA   3   6  -9  -6  -6  -2   0   9
            BETA   -5  -3   3  -8  -3  -2   5   8
      b     ALPHA  -4   4  -1   0   7  -4   6   6
            BETA   -9   9  -6   8   5  -2  -9  -8
B     a     ALPHA   0  -9   1  -6   2   9  -7  -9

In [106]:
df_temp = df_ex.copy()
new_idx = df_temp.index.map(lambda x: (x[0]+'-'+x[1]+'-'+x[2]))
df_temp.index = new_idx
df_temp.head()

Big         C               D
Small       c       d       c       d
Other     cat dog cat dog cat dog cat dog
A-a-alpha   3   6  -9  -6  -6  -2   0   9
A-a-beta   -5  -3   3  -8  -3  -2   5   8
A-b-alpha  -4   4  -1   0   7  -4   6   6
A-b-beta   -9   9  -6   8   5  -2  -9  -8
B-a-alpha   0  -9   1  -6   2   9  -7  -9

In [107]:
new_idx = df_temp.index.map(lambda x:tuple(x.split('-')))
df_temp.index = new_idx
df_temp.head() # 三层索引

Big         C               D
Small       c       d       c       d
Other     cat dog cat dog cat dog cat dog
A a alpha   3   6  -9  -6  -6  -2   0   9
    beta   -5  -3   3  -8  -3  -2   5   8
  b alpha  -4   4  -1   0   7  -4   6   6
    beta   -9   9  -6   8   5  -2  -9  -8
B a alpha   0  -9   1  -6   2   9  -7  -9

### 3.索引的设置与重置

In [108]:
df_new = pd.DataFrame({'A':list('aacd'),'B':list('PQRT'),'C':[1,2,3,4]})
df_new

   A  B  C
0  a  P  1
1  a  Q  2
2  c  R  3
3  d  T  4

- set_index

In [109]:
df_new.set_index('A')

   B  C
A
a  P  1
a  Q  2
c  R  3
d  T  4

In [110]:
df_new.set_index('A', append=True)
#表示是否来保留原来的索引，直接把新设定的添加到原索引的内层
#保留了原索引0123

     B  C
  A
0 a  P  1
1 a  Q  2
2 c  R  3
3 d  T  4

In [111]:
df_new.set_index(['A', 'B'])#同时指定多个列作为索引

     C
A B
a P  1
  Q  2
c R  3
d T  4

In [112]:
my_index = pd.Series(list('WXYZ'), name='D')
df_new = df_new.set_index(['A', my_index])
df_new

     B  C
A D
a W  P  1
  X  Q  2
c Y  R  3
d Z  T  4

- reset_index

In [113]:
df_new.reset_index(['D'])#把D从索引中拿出来

   D  B  C
A
a  W  P  1
a  X  Q  2
c  Y  R  3
d  Z  T  4

In [114]:
df_new.reset_index(['D'], drop=True)
#主要参数是 drop ，表示是否要把去掉的索引层丢弃，而不是添加到列中

   B  C
A
a  P  1
a  Q  2
c  R  3
d  T  4

In [115]:
df_new.reset_index()#重置了所有的索引

   A  D  B  C
0  a  W  P  1
1  a  X  Q  2
2  c  Y  R  3
3  d  Z  T  4

### 4.索引的变形
在某些场合下，需要对索引做一些扩充或者剔除，更具体地要求是给定一个新的索引，把原表中相应的索引对应元素填充到新索引构成的表中

- reindex

In [116]:
df_reindex = pd.DataFrame({"Weight":[60,70,80],"Height":[176,180,179]},index=['1001','1003','1002'])
df_reindex

      Weight  Height
1001      60     176
1003      70     180
1002      80     179

In [117]:
df_reindex.reindex(index=['1001','1002','1003','1004'],columns=['Weight','Gender'])

      Weight  Gender
1001    60.0     NaN
1002    80.0     NaN
1003    70.0     NaN
1004     NaN     NaN

- reindex_like仿照传入的表的索引来进行被调用表索引的变形

In [118]:
df_existed = pd.DataFrame(index=['1001','1002','1003','1004'],columns=['Weight','Gender'])
df_reindex.reindex_like(df_existed)

      Weight  Gender
1001    60.0     NaN
1002    80.0     NaN
1003    70.0     NaN
1004     NaN     NaN

## 四、索引运算
### 1.索引运算
由于集合的元素是互异的，但是索引中可能有相同的元素，先用 unique 去重后再进行运算。

In [119]:
df_set_1 = pd.DataFrame([[0,1],[1,2],[3,4]],index = pd.Index(['a','b','a'],name='id1'))
df_set_2 = pd.DataFrame([[4,5],[2,6],[7,1]],index = pd.Index(['b','b','c'],name='id2'))
id1,id2=df_set_1.index.unique(), df_set_2.index.unique()
print(id1,id2)

Index(['a', 'b'], dtype='object', name='id1') Index(['b', 'c'], dtype='object', name='id2')

In [120]:
id1.intersection(id2)#交集

Index(['b'], dtype='object')

In [121]:
id1.union(id2)#并集

Index(['a', 'b', 'c'], dtype='object')

In [122]:
id1.difference(id2)#差集，在1里面，不在2里面

Index(['a'], dtype='object')

In [123]:
id1.symmetric_difference(id2)#12的并集减去12的交集

Index(['a', 'c'], dtype='object')

In [124]:
id1 & id2

Index(['b'], dtype='object')

In [125]:
id1 | id2

Index(['a', 'b', 'c'], dtype='object')

In [126]:
(id1 ^ id2) & id1# ^符号即对称差

Index(['a'], dtype='object')

In [127]:
id1 ^ id2

Index(['a', 'c'], dtype='object')

- isin函数

In [128]:
df_set_in_col_1 = df_set_1.reset_index()
df_set_in_col_2 = df_set_2.reset_index()
df_set_in_col_1

  id1  0  1
0   a  0  1
1   b  1  2
2   a  3  4

In [129]:
df_set_in_col_2

  id2  0  1
0   b  4  5
1   b  2  6
2   c  7  1

In [130]:
df_set_in_col_1[df_set_in_col_1.id1.isin(df_set_in_col_2.id2)]#在重置索引的第一张表中选出id列交集的所在行

  id1  0  1
1   b  1  2

## 五、练习
### EX1：公司员工数据集
现有一份公司员工数据集：

In [131]:
df = pd.read_csv('D:\\datawhale\\joyful-pandas\\data\\company.csv')
df.head(3)

   EmployeeID birthdate_key  age  city_name department      job_title gender
0        1318      1/3/1954   61  Vancouver  Executive            CEO      M
1        1319      1/3/1957   58  Vancouver  Executive      VP Stores      F
2        1320      1/2/1955   60  Vancouver  Executive  Legal Counsel      F

### 1.分别只使用 query 和 loc 选出年龄不超过四十岁且工作部门为 Dairy 或 Bakery 的男性。

- query方法

In [132]:
df.query('(age<=40)&''((department=="Dairy")|''(department=="Bakery"))&''(gender=="M")').head()
#将官方答案注释
#dpt = ['Dairy', 'Bakery']
#df.query("(age <= 40)&(department == @dpt)&(gender=='M')").head(3)

      EmployeeID birthdate_key  age city_name department     job_title gender
3611        5791     1/14/1975   40   Kelowna      Dairy  Dairy Person      M
3613        5793     1/22/1975   40  Richmond     Bakery         Baker      M
3615        5795     1/30/1975   40   Nanaimo      Dairy  Dairy Person      M
3617        5797      2/3/1975   40   Nanaimo      Dairy  Dairy Person      M
3618        5798      2/4/1975   40    Surrey      Dairy  Dairy Person      M

- loc索引器

In [133]:
condition=(df.age<=40) & ((df.department == 'Dairy') | (df.department == 'Bakery')) & (df.gender == 'M')
df.loc[condition].head()
#df.loc[(df.age<=40)&df.department.isin(dpt)&(df.gender=='M')].head(3)

      EmployeeID birthdate_key  age city_name department     job_title gender
3611        5791     1/14/1975   40   Kelowna      Dairy  Dairy Person      M
3613        5793     1/22/1975   40  Richmond     Bakery         Baker      M
3615        5795     1/30/1975   40   Nanaimo      Dairy  Dairy Person      M
3617        5797      2/3/1975   40   Nanaimo      Dairy  Dairy Person      M
3618        5798      2/4/1975   40    Surrey      Dairy  Dairy Person      M

### 2.选出员工 ID 号 为奇数所在行的第1、第3和倒数第2列。

In [134]:
condition=df.EmployeeID%2!=0
df[condition].iloc[:,[0,1,5]].head()
#df.iloc[(df.EmployeeID%2==1).values,[0,2,-2]].head()
#使用布尔列表的时候要特别注意，不能传入 Series 而必须传入序列的 values

   EmployeeID birthdate_key                      job_title
1        1319      1/3/1957                      VP Stores
3        1321      1/2/1959             VP Human Resources
5        1323      1/9/1962      Exec Assistant, VP Stores
6        1325     1/13/1964  Exec Assistant, Legal Counsel
8        1329     1/23/1967                  Store Manager

### 3.按照以下步骤进行索引操作：

- 把后三列设为索引后交换内外两层

In [135]:
df_index=df.set_index(['department','job_title','gender'])

In [136]:
df_index.head(3)

                                 EmployeeID birthdate_key  age  city_name
department job_title     gender
Executive  CEO           M             1318      1/3/1954   61  Vancouver
           VP Stores     F             1319      1/3/1957   58  Vancouver
           Legal Counsel F             1320      1/2/1955   60  Vancouver

In [137]:
df_index=df_index.reorder_levels([2,1,0],axis=0)
df_index.head(3)
#df_op = df_op.set_index(df_op.columns[-3:].tolist()).swaplevel(0,2,axis=0)
#答案一句话解决了
#先用set_index设置【-3：】后三列为索引，再swaplevel 0 与 2

                                 EmployeeID birthdate_key  age  city_name
gender job_title     department
M      CEO           Executive         1318      1/3/1954   61  Vancouver
F      VP Stores     Executive         1319      1/3/1957   58  Vancouver
       Legal Counsel Executive         1320      1/2/1955   60  Vancouver

- 恢复中间一层

In [138]:
df_index=df_index.reset_index('job_title')
df_index.head(3)
#df_op = df_op.reset_index(level=1)

                       job_title  EmployeeID birthdate_key  age  city_name
gender department
M      Executive             CEO        1318      1/3/1954   61  Vancouver
F      Executive       VP Stores        1319      1/3/1957   58  Vancouver
       Executive   Legal Counsel        1320      1/2/1955   60  Vancouver

- 修改外层索引名为 Gender

In [139]:
df_index=df_index.rename_axis(index={'gender':'Gender'})
df_index.head(3)

                       job_title  EmployeeID birthdate_key  age  city_name
Gender department
M      Executive             CEO        1318      1/3/1954   61  Vancouver
F      Executive       VP Stores        1319      1/3/1957   58  Vancouver
       Executive   Legal Counsel        1320      1/2/1955   60  Vancouver

- 用下划线合并两层行索引

In [140]:
idx=df_index.index.map(lambda x:(x[0]+'_'+x[1]))
df_index.index=idx
df_index.head(3)
#df_op.index = df_op.index.map(lambda x:'_'.join(x))
#lambda x:'_'.join(x)

                 job_title  EmployeeID birthdate_key  age  city_name
M_Executive            CEO        1318      1/3/1954   61  Vancouver
F_Executive      VP Stores        1319      1/3/1957   58  Vancouver
F_Executive  Legal Counsel        1320      1/2/1955   60  Vancouver

- 把行索引拆分为原状态

In [141]:
idx=df_index.index.map(lambda x:tuple(x.split('_')))
df_index.index=idx
df_index.head(3)

                 job_title  EmployeeID birthdate_key  age  city_name
M Executive            CEO        1318      1/3/1954   61  Vancouver
F Executive      VP Stores        1319      1/3/1957   58  Vancouver
  Executive  Legal Counsel        1320      1/2/1955   60  Vancouver

- 修改索引名为原表名称

In [142]:
df_index = df_index.rename_axis(index=['gender', 'department'])
df_index.head(3)

                       job_title  EmployeeID birthdate_key  age  city_name
gender department
M      Executive             CEO        1318      1/3/1954   61  Vancouver
F      Executive       VP Stores        1319      1/3/1957   58  Vancouver
       Executive   Legal Counsel        1320      1/2/1955   60  Vancouver

- 恢复默认索引并将列保持为原表的相对位置

In [143]:
df_index=df_index.reset_index()#释放所有索引
df_index=df_index.reindex(df.columns,axis=1)
df_index.head(3)

   EmployeeID birthdate_key  age  city_name department      job_title gender
0        1318      1/3/1954   61  Vancouver  Executive            CEO      M
1        1319      1/3/1957   58  Vancouver  Executive      VP Stores      F
2        1320      1/2/1955   60  Vancouver  Executive  Legal Counsel      F

In [144]:
df_index.equals(df)

True

### EX2：巧克力数据集
现有一份关于巧克力评价的数据集：

In [145]:
df = pd.read_csv('D:\\datawhale\\joyful-pandas\\data\\chocolate.csv')
df.head(3)

    Company  Review\r\nDate Cocoa\r\nPercent Company\r\nLocation  Rating
0  A. Morin            2016              63%              France    3.75
1  A. Morin            2015              70%              France    2.75
2  A. Morin            2015              70%              France    3.00

### 1.把列索引名中的 \n 替换为空格

In [146]:
df.columns=[df.columns[i].replace("\r\n"," ") for i in range(df.shape[1])]
df.head(3)

    Company  Review Date Cocoa Percent Company Location  Rating
0  A. Morin         2016           63%           France    3.75
1  A. Morin         2015           70%           France    2.75
2  A. Morin         2015           70%           France    3.00

### 2.巧克力 Rating 评分为1至5，每0.25分一档，请选出2.75分及以下且可可含量 Cocoa Percent 高于中位数的样本。

In [147]:
df['Cocoa Percent']=df['Cocoa Percent'].apply(lambda x:float(x[:-1])/100)
#先将字符串的百分数转化成数值型
df.head(3)

    Company  Review Date  Cocoa Percent Company Location  Rating
0  A. Morin         2016           0.63           France    3.75
1  A. Morin         2015           0.70           France    2.75
2  A. Morin         2015           0.70           France    3.00

In [148]:
df.columns

Index(['Company', 'Review Date', 'Cocoa Percent', 'Company Location',
       'Rating'],
      dtype='object')

In [149]:
condition=(df.Rating<=2.75) & (df['Cocoa Percent']>df['Cocoa Percent'].median())
df_temp=df[condition]
df_temp.head(3)

               Company  Review Date  Cocoa Percent Company Location  Rating
33  Akesson's (Pralus)         2010           0.75      Switzerland    2.75
34  Akesson's (Pralus)         2010           0.75      Switzerland    2.75
36       Alain Ducasse         2014           0.75           France    2.75

### 3.将 Review Date 和 Company Location 设为索引后，选出 Review Date 在2012年之后且 Company Location 不属于 France, Canada, Amsterdam, Belgium 的样本。

In [150]:
df3=df.set_index(['Review Date','Company Location'])
df3.head(3)

                               Company  Cocoa Percent  Rating
Review Date Company Location
2016        France            A. Morin           0.63    3.75
2015        France            A. Morin           0.70    2.75
            France            A. Morin           0.70    3.00

In [151]:
idx = pd.IndexSlice
opt=['France','Canada','Amsterdam','Belgium']
res = df3.sort_index(level=0)
res.head(3)

                                          Company  Cocoa Percent  Rating
Review Date Company Location
2006        Belgium            Cote d' Or (Kraft)           0.70     1.0
            Belgium            Dolfin (Belcolade)           0.70     1.5
            Belgium           Neuhaus (Callebaut)           0.73     2.0

In [152]:
res.index.get_level_values(1)

Index(['Belgium', 'Belgium', 'Belgium', 'Belgium', 'Belgium', 'Belgium',
       'Belgium', 'Belgium', 'Colombia', 'Colombia',
       ...
       'U.S.A.', 'U.S.A.', 'U.S.A.', 'U.S.A.', 'U.S.A.', 'U.S.A.', 'U.S.A.',
       'U.S.A.', 'U.S.A.', 'U.S.A.'],
      dtype='object', name='Company Location', length=1795)

In [153]:
res.loc[idx[2012:,~res.index.get_level_values(1).isin(opt)],idx[:]].head(3)
#loc[idx[],idx[]]
#res.loc[idx[2012:,~res.index.get_level_values(1).isin(opt)],:]

                                  Company  Cocoa Percent  Rating
Review Date Company Location
2012        Australia         Bahen & Co.            0.7     3.0
            Australia         Bahen & Co.            0.7     2.5
            Australia         Bahen & Co.            0.7     2.5